// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().

// let number = prompt("Введіть число");
// console.log(number);
// number = Number(number);

// if (number === 10) {
//   alert("Вірно");
// } else {
//   alert("Невірно");
// }

// const isAdult = confirm("Чи є Вам 18 років?");
// console.log(isAdult);

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);
// if (min > 0 && min < 15) {
//     alert(`${min} входить у першу чверть`);
// } else if (min => 15 && min <= 30) {
//   alert(`${min} входить у другу чверть`);
// } else if (min >= 30 && min <= 45) {
//   alert(`${min} входить у третю чверть`);
// } else (min > 45 && min <= 59){
//   alert(`${min} входить у третю чверть`);
// }
// console.log(min)

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.

// const num = prompt("Введіть число");

// switch (num) {
//   case "1":
//     console.log("зима");
//     break;
//   case "2":
//     console.log("весна");
//     break;
//   case "3":
//     console.log("літо");
//     break;
//   case "4":
//     console.log("осінь");
//     break;
//   default:
//     console.log("не відомо");
// }

// Використайте цикл while, щоб вивести в console
// всі числа від 0 до 20 включно.

// let count = 0;

// while (count <= 20) {
//   console.log(`Count: ${count}`);
//   count += 1;
// }

// Напишіть функцію getNumbers(min, max),
// що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції,
// який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел
// в цьому циклі і поверніть її з функції.

// function getNumbers(min, max) {
//   let sum = 0;
//   for (let i = max; i >= min; i--) {
//     console.log(i);
//     if (i % 2 === 0) {
//       sum += i;
//     }
//   }
//   return sum;
// }
// const result = getNumbers(1, 10);
// console.log(`сума парних чисел ${result}`);
// console.log(getNumbers(1, 20));

// Напишіть функцію min(a, b),
// яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа,
// в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//   if (typeof a !== "number" || typeof b !== "number") return "Not a number";

//   return a < b ? a : b;
// }

// console.log(min(1, 31));

// Доповни код таким чином, щоб у змінну number записувалося перше число у проміжку від start до end,
//   яке ділиться на 5 без остачі.
// Оголошена змінна start
// Оголошена змінна end
// Оголошена змінна number
// Якщо start це 6, а end це 17, то підсумкове значення змінної number дорівнює 10
// Якщо start це 17, а end це 25, то підсумкове значення змінної number дорівнює 20
// Якщо start це 2, а end це 11, то підсумкове значення змінної number дорівнює 5
// В коді є цикл for, в якому використовується break для можливості виходу з циклу
// до завершення всіх ітерацій

const start = 6;
const end = 17;
let number;

for (let i = start; i <= end; i += 1) {
  if (i % 5 === 0) {
    number = i;
    break; // Зупиняємо цикл після знаходження першого підходящого числа
  }
}
console.log(number);
